#include <stdio.h> // Підключення бібліотек
#include <math.h> // Підключення обчислень
int main() {
    double s = 0, p;

    for (int i = 1; i <= 25; i++) {     // зовнішній цикл по i
        p = 1;                           // скидаємо добуток на кожній ітерації
        for (int j = 1; j <= i; j++) {  // внутрішній цикл по j
            p *= (double)(j + i) / 2;   // множимо на (j+i)/2
        }
        s += p;                          // додаємо добуток до суми
    }

    printf("s = %g\n", s);
    return 0;
}
