#include <stdio.h> // Підключення бібліотек
#include <math.h> // Підключення обчислень
  int main() { // Початок коду
    int a, b;
    double z1, z2, z3;
    
    printf("Введіть перше число: ");
    scanf("%d", &a);

    printf("Введіть друге число: ");
    scanf("%d", &b);
    
    z1 = b - a; // Різниця
    z2 = (a + b) / 2.0; // Середнє арифметичне
    z3 = sqrt((double)(a + b)); // Корінь квадратний з суми

    printf("Різниця (b - a) = %.2f\n", z1);
    printf("Середнє арифметичне = %.2f\n", z2);
    printf("Корінь квадратний з суми = %.2f\n", z3);

   return 0; // Кінець коду
  }
